[
  {"id":"arnon_etal25","author":[{"family":"Arnon","given":"Inbal"},{"family":"Kirby","given":"Simon"},{"family":"Allen","given":"Jenny A"},{"family":"Garrigue","given":"Claire"},{"family":"Carroll","given":"Emma L"},{"family":"Garland","given":"Ellen C"}],"citation-key":"arnon_etal25","container-title":"Science","DOI":"10.1126/science.adq7055","issue":"6734","issued":{"date-parts":[["2025"]]},"language":"en","page":"649-653","source":"Zotero","title":"Whale song shows language-like statistical structure","type":"article-journal","volume":"387"},
  {"id":"arnon_kirby24","abstract":"Abstract\n            Human language is unique in its structure: language is made up of parts that can be recombined in a productive way. The parts are not given but have to be discovered by learners exposed to unsegmented wholes. Across languages, the frequency distribution of those parts follows a power law. Both statistical properties—having parts and having them follow a particular distribution—facilitate learning, yet their origin is still poorly understood. Where do the parts come from and why do they follow a particular frequency distribution? Here, we show how these two core properties emerge from the process of cultural evolution with whole-to-part learning. We use an experimental analog of cultural transmission in which participants copy sets of non-linguistic sequences produced by a previous participant: This design allows us to ask if parts will emerge purely under pressure for the system to be learnable, even without meanings to convey. We show that parts emerge from initially unsegmented sequences, that their distribution becomes closer to a power law over generations, and, importantly, that these properties make the sets of sequences more learnable. We argue that these two core statistical properties of language emerge culturally both as a cause and effect of greater learnability.","accessed":{"date-parts":[["2024",5,16]]},"author":[{"family":"Arnon","given":"Inbal"},{"family":"Kirby","given":"Simon"}],"citation-key":"arnon_kirby24","container-title":"Scientific Reports","container-title-short":"Sci. Rep.","DOI":"10.1038/s41598-024-56152-9","ISSN":"2045-2322","issue":"1","issued":{"date-parts":[["2024",3,4]]},"language":"en","page":"5255","source":"DOI.org (Crossref)","title":"Cultural evolution creates the statistical structure of language","type":"article-journal","URL":"https://www.nature.com/articles/s41598-024-56152-9","volume":"14"},
  {"id":"feher_etal09","abstract":"Culture is typically viewed as consisting of traits inherited epigenetically, through social learning. However, cultural diversity has species-typical constraints, presumably of genetic origin. A celebrated, if contentious, example is whether a universal grammar constrains syntactic diversity in human languages. Oscine songbirds exhibit song learning and provide biologically tractable models of culture: members of a species show individual variation in song and geographically separated groups have local song dialects. Different species exhibit distinct song cultures, suggestive of genetic constraints. Without such constraints, innovations and copying errors should cause unbounded variation over multiple generations or geographical distance, contrary to observations. Here we report an experiment designed to determine whether wild-type song culture might emerge over multiple generations in an isolated colony founded by isolates, and, if so, how this might happen and what type of social environment is required. Zebra finch isolates, unexposed to singing males during development, produce song with characteristics that differ from the wild-type song found in laboratory or natural colonies. In tutoring lineages starting from isolate founders, we quantified alterations in song across tutoring generations in two social environments: tutor-pupil pairs in sound-isolated chambers and an isolated semi-natural colony. In both settings, juveniles imitated the isolate tutors but changed certain characteristics of the songs. These alterations accumulated over learning generations. Consequently, songs evolved towards the wild-type in three to four generations. Thus, species-typical song culture can appear de novo. Our study has parallels with language change and evolution. In analogy to models in quantitative genetics, we model song culture as a multigenerational phenotype partly encoded genetically in an isolate founding population, influenced by environmental variables and taking multiple generations to emerge.","author":[{"family":"Fehér","given":"Ola"},{"family":"Wang","given":"Haibin"},{"family":"Saar","given":"Sigal"},{"family":"Mitra","given":"Partha P"},{"family":"Tchernichovski","given":"Ofer"}],"citation-key":"feher_etal09","container-title":"Nature","DOI":"10.1038/nature07994","issue":"7246","issued":{"date-parts":[["2009"]]},"page":"564-568","title":"De novo establishment of wild-type song culture in the zebra finch","type":"article-journal","URL":"http://www.ncbi.nlm.nih.gov/pubmed/19412161","volume":"459"},
  {"id":"izsak06","accessed":{"date-parts":[["2023",9,6]]},"author":[{"family":"Izsák","given":"János"}],"citation-key":"izsak06","container-title":"Scientometrics","container-title-short":"Scientometrics","DOI":"10.1007/s11192-006-0052-x","ISSN":"0138-9130, 1588-2861","issue":"1","issued":{"date-parts":[["2006",4]]},"language":"en","page":"107-120","source":"DOI.org (Crossref)","title":"Some practical aspects of fitting and testing the Zipf-Mandelbrot model: a short essay","title-short":"Some practical aspects of fitting and testing the Zipf-Mandelbrot model","type":"article-journal","URL":"http://link.springer.com/10.1007/s11192-006-0052-x","volume":"67"},
  {"id":"james_etal20","abstract":"Biological predispositions in learning can bias and constrain the cultural evolution of social and communicative behaviors (e.g., speech and birdsong), and lead to the emergence of behavioral and cultural “universals.” For example, surveys of laboratory and wild populations of zebra finches (Taeniopygia guttata) document consistent patterning of vocal elements (“syllables”) with respect to their acoustic properties (e.g., duration, mean frequency). Furthermore, such universal patterns are also produced by birds that are experimentally tutored with songs containing randomly sequenced syllables (“tutored birds”). Despite extensive demonstrations of learning biases, much remains to be uncovered about the nature of biological predispositions that bias song learning and production in songbirds. Here, we examined the degree to which “innate” auditory templates and/or biases in vocal motor production contribute to vocal learning biases and production in zebra finches. Such contributions can be revealed by examining acoustic patterns in the songs of birds raised without sensory exposure to song (“untutored birds”) or of birds that are unable to hear from early in development (“early-deafened birds”). We observed that untutored zebra finches and early-deafened zebra finches produce songs with positional variation in some acoustic features (e.g., mean frequency) that resemble universal patterns observed in tutored birds. Similar to tutored birds, early-deafened birds also produced song motifs with alternation in acoustic features across adjacent syllables. That universal acoustic patterns are observed in the songs of both untutored and early-deafened birds highlights the contribution motor production biases to the emergence of universals in culturally transmitted behaviors.","accessed":{"date-parts":[["2025",7,28]]},"author":[{"family":"James","given":"Logan S."},{"family":"Davies","given":"Ronald"},{"family":"Mori","given":"Chihiro"},{"family":"Wada","given":"Kazuhiro"},{"family":"Sakata","given":"Jon T."}],"citation-key":"james_etal20","container-title":"Developmental Neurobiology","container-title-short":"Developmental Neurobiology","DOI":"10.1002/dneu.22754","ISSN":"1932-8451, 1932-846X","issue":"3-4","issued":{"date-parts":[["2020",3]]},"language":"en","page":"132-146","source":"DOI.org (Crossref)","title":"Manipulations of sensory experiences during development reveal mechanisms underlying vocal learning biases in zebra finches","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1002/dneu.22754","volume":"80"},
  {"id":"james_etal21","abstract":"Organizational patterns can be shared across biological systems, and revealing the factors shaping common patterns can provide insight into fundamental biological mechanisms. The behavioral pattern that elements with more constituents tend to consist of shorter constituents (Menzerath’s law [ML]) was described ﬁrst in speech and language (e.g., words with more syllables consist of shorter syllables) and subsequently in music and animal communication. Menzerath’s law is hypothesized to reﬂect efﬁciency in information transfer, but biases and constraints in motor production can also lead to this pattern. We investigated the evolutionary breadth of ML and the contribution of production mechanisms to ML in the songs of 15 songbird species. Negative relationships between the number and duration of constituents (e.g., syllables in phrases) were observed in all 15 species. However, negative relationships were also observed in null models in which constituents were randomly allocated into observed element durations, and the observed negative relationship for numerous species did not differ from the null model; consequently, ML in these species could simply reﬂect production constraints and not communicative efﬁciency. By contrast, ML was signiﬁcantly different from the null model for more than half the cases, suggesting additional organizational rules are imposed onto birdsongs. Production mechanisms are also underscored by the ﬁnding that canaries and zebra ﬁnches reared without auditory experiences that guide vocal development produced songs with nearly identical ML patterning as typically reared birds. These analyses highlight the breadth with which production mechanisms contribute to this prevalent organizational pattern in behavior.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"James","given":"Logan S."},{"family":"Mori","given":"Chihiro"},{"family":"Wada","given":"Kazuhiro"},{"family":"Sakata","given":"Jon T."}],"citation-key":"james_etal21","container-title":"Current Biology","container-title-short":"Current Biology","DOI":"10.1016/j.cub.2021.04.015","ISSN":"09609822","issue":"13","issued":{"date-parts":[["2021",7]]},"language":"en","page":"2796-2808.e9","source":"DOI.org (Crossref)","title":"Phylogeny and mechanisms of shared hierarchical patterns in birdsong","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0960982221005285","volume":"31"},
  {"id":"james_sakata17","author":[{"family":"James","given":"Logan S."},{"family":"Sakata","given":"Jon T."}],"citation-key":"james_sakata17","container-title":"Current Biology","DOI":"10.1016/j.cub.2017.10.019","issue":"23","issued":{"date-parts":[["2017"]]},"page":"3676-3682","publisher":"Elsevier Ltd.","title":"Learning biases underlie \"universals\" in avian vocal sequencing","type":"article-journal","volume":"27"},
  {"id":"kanwal_etal17","abstract":"The linguist George Kingsley Zipf made a now classic observation about the relationship between a word’s length and its frequency; the more frequent a word is, the shorter it tends to be. He claimed that this ‘‘Law of Abbreviation” is a universal structural property of language. The Law of Abbreviation has since been documented in a wide range of human languages, and extended to animal communication systems and even computer programming languages. Zipf hypothesised that this universal design feature arises as a result of individuals optimising form-meaning mappings under competing pressures to communicate accurately but also efﬁciently—his famous Principle of Least Effort. In this study, we use a miniature artiﬁcial language learning paradigm to provide direct experimental evidence for this explanatory hypothesis. We show that language users optimise form-meaning mappings only when pressures for accuracy and efﬁciency both operate during a communicative task, supporting Zipf’s conjecture that the Principle of Least Effort can explain this universal feature of word length distributions.","accessed":{"date-parts":[["2023",8,9]]},"author":[{"family":"Kanwal","given":"Jasmeen"},{"family":"Smith","given":"Kenny"},{"family":"Culbertson","given":"Jennifer"},{"family":"Kirby","given":"Simon"}],"citation-key":"kanwal_etal17","container-title":"Cognition","container-title-short":"Cognition","DOI":"10.1016/j.cognition.2017.05.001","ISSN":"00100277","issued":{"date-parts":[["2017",8]]},"language":"en","page":"45-52","source":"DOI.org (Crossref)","title":"Zipf’s law of abbreviation and the principle of least effort: language users optimise a miniature lexicon for efficient communication","title-short":"Zipf’s Law of Abbreviation and the Principle of Least Effort","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0010027717301166","volume":"165"},
  {"id":"menzerath54","author":[{"family":"Menzerath","given":"Paul"}],"citation-key":"menzerath54","event-place":"Bonn","issued":{"date-parts":[["1954"]]},"publisher":"Dümmler","publisher-place":"Bonn","title":"Die Architektonik des Deutschen Wortschatzes","type":"book"},
  {"id":"morin_koshevoy25","abstract":"Abstract\n            Efficiency principles are increasingly called upon to study features of human language and communication. Zipf's law of abbreviation is widely seen as a classic instance of a linguistic pattern brought about by language users’ search for efficient communication. The “law”—a recurrent correlation between the frequency of words and their brevity—is a near‐universal principle of communication, having been found in all of the hundreds of human languages where it has been tested, and a few nonhuman communication systems as well. The standard explanation for the law of abbreviation derives from pressures for efficiency: speakers minimize their cumulative effort by using shorter words for frequent occurrences. This explanation, we argue here, fails to explain why long words exist at all. It also fails to explain why the law of abbreviation, despite being robust, is systematically weakened by many short and rare words. We propose an alternative account of the law of abbreviation, based on a simple cultural evolutionary model. Our model does not require any pressure for efficiency. Instead, it derives the law of abbreviation from a general pressure for brevity applying to all words regardless of their frequency. This model makes two accurate predictions that the standard model misses: the correlation between frequency and brevity is consistently weak, and it is characterized by heteroskedasticity, with many short and rare words. We argue on this basis that efficiency considerations are neither necessary nor sufficient to explain the law.\n          , \n            The law of abbreviation, a near‐universal correlation between the frequency of words and their brevity, is widely seen as a hallmark illustration of the efficiency of communication. We show how it can evolve even without a need to shorten frequent words specifically.","author":[{"family":"Morin","given":"Olivier"},{"family":"Koshevoy","given":"Alexey"}],"citation-key":"morin_koshevoy25","container-title":"Topics in Cognitive Science","container-title-short":"Topics in Cognitive Science","DOI":"10.1111/tops.12782","issued":{"date-parts":[["2025"]]},"language":"en","source":"DOI.org (Crossref)","title":"A cultural evolutionary model for the law of abbreviation","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1111/tops.12782"},
  {"id":"piantadosi14","abstract":"The frequency distribution of words has been a key object of study in statistical linguistics for the past 70 years. This distribution approximately follows a simple mathematical form known as Zipf ’ s law. This article first shows that human language has a highly complex, reliable structure in the frequency distribution over and above this classic law, although prior data visualization methods have obscured this fact. A number of empirical phenomena related to word frequencies are then reviewed. These facts are chosen to be informative about the mechanisms giving rise to Zipf’s law and are then used to evaluate many of the theoretical explanations of Zipf’s law in language. No prior account straightforwardly explains all the basic facts or is supported with independent evaluation of its underlying assumptions. To make progress at understanding why language obeys Zipf’s law, studies must seek evidence beyond the law itself, testing assumptions and evaluating novel predictions with new, independent data.","accessed":{"date-parts":[["2023",8,3]]},"author":[{"family":"Piantadosi","given":"Steven T."}],"citation-key":"piantadosi14","container-title":"Psychonomic bulletin & review","container-title-short":"Psychon Bull Rev","DOI":"10.3758/s13423-014-0585-6","ISSN":"1069-9384","issue":"5","issued":{"date-parts":[["2014",10]]},"page":"1112-1130","PMCID":"PMC4176592","PMID":"24664880","source":"PubMed Central","title":"Zipf’s word frequency law in natural language: A critical review and future directions","title-short":"Zipf’s word frequency law in natural language","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4176592/","volume":"21"},
  {"id":"tchernichovski_etal21","abstract":"Songbirds acquire songs by imitation, as humans do speech. Although imitation should drive convergence within a group and divergence through drift between groups, zebra finch songs sustain high diversity within a colony, but mild variation across colonies. We investigated this phenomenon by analyzing vocal learning statistics in 160 tutor-pupil pairs from a large breeding colony. Song imitation is persistently accurate in some families, but poor in others. This is not attributed to genetic differences, as fostered pupils copied their tutors’ songs as accurately or poorly as biological pupils. Rather, pupils of tutors with low song diversity make more improvisations compared to pupils of tutors with high song diversity. We suggest that a frequency dependent balanced imitation prevents extinction of rare song elements and overabundance of common ones, promoting repertoire diversity within groups, while constraining drift across groups, which together prevents the collapse of vocal culture into either complete uniformity or chaos.","author":[{"family":"Tchernichovski","given":"Ofer"},{"family":"Eisenberg-Edidin","given":"Sophie"},{"family":"Jarvis","given":"Erich D."}],"citation-key":"tchernichovski_etal21","container-title":"Nature Communications","DOI":"10.1038/s41467-021-22852-3","ISSN":"20411723","issue":"1","issued":{"date-parts":[["2021"]]},"page":"1-14","PMID":"33963187","publisher":"Springer US","title":"Balanced imitation sustains song culture in zebra finches","type":"article-journal","URL":"http://dx.doi.org/10.1038/s41467-021-22852-3","volume":"12"},
  {"id":"torre_etal19","abstract":"Physical manifestations of linguistic units include sources of variability due to factors of speech production which are by definition excluded from counts of linguistic symbols. In this work, we examine whether linguistic laws hold with respect to the physical manifestations of linguistic units in spoken English. The data we analyse come from a phonetically transcribed database of acoustic recordings of spontaneous speech known as the Buckeye Speech corpus. First, we verify with unprecedented accuracy that acoustically transcribed durations of linguistic units at several scales comply with a lognormal distribution, and we quantitatively justify this ‘lognormality law’ using a stochastic generative model. Second, we explore the four classical linguistic laws (Zipf’s Law, Herdan’s Law, Brevity Law and Menzerath–Altmann’s Law (MAL)) in oral communication, both in physical units and in symbolic units measured in the speech transcriptions, and find that the validity of these laws is typically stronger when using physical units than in their symbolic counterpart. Additional results include (i) coining a Herdan’s Law in physical units, (ii) a precise mathematical formulation of Brevity Law, which we show to be connected to optimal compression principles in information theory and allows to formulate and validate yet another law which we call the size-rank law or (iii) a mathematical derivation of MAL which also highlights an additional regime where the law is inverted. Altogether, these results support the hypothesis that statistical laws in language have a physical origin.","accessed":{"date-parts":[["2023",4,12]]},"author":[{"family":"Torre","given":"Iván G."},{"family":"Luque","given":"Bartolo"},{"family":"Lacasa","given":"Lucas"},{"family":"Kello","given":"Christopher T."},{"family":"Hernández-Fernández","given":"Antoni"}],"citation-key":"torre_etal19","container-title":"Royal Society Open Science","container-title-short":"R. Soc. open sci.","DOI":"10.1098/rsos.191023","ISSN":"2054-5703","issue":"8","issued":{"date-parts":[["2019",8]]},"language":"en","page":"191023","source":"DOI.org (Crossref)","title":"On the physical origin of linguistic laws and lognormality in speech","type":"article-journal","URL":"https://royalsocietypublishing.org/doi/10.1098/rsos.191023","volume":"6"},
  {"id":"youngblood24","accessed":{"date-parts":[["2024",4,3]]},"author":[{"family":"Youngblood","given":"Mason"}],"citation-key":"youngblood24","container-title":"Proceedings of the Royal Society B","container-title-short":"Proc. R. Soc. B.","DOI":"10.1098/rspb.2024.0250","issue":"2020","issued":{"date-parts":[["2024"]]},"language":"en","license":"All rights reserved","page":"20240250","title":"Language-like efficiency and structure in house finch song","type":"article-journal","volume":"291"},
  {"id":"youngblood25","author":[{"family":"Youngblood","given":"Mason"}],"citation-key":"youngblood25","container-title":"Science Advances","DOI":"10.1126/sciadv.ads6014","issued":{"date-parts":[["2025"]]},"language":"en","page":"eads6014","source":"Zotero","title":"Language-like efficiency in whale communication","type":"article-journal","volume":"11"},
  {"id":"zipf49","author":[{"family":"Zipf","given":"George"}],"citation-key":"zipf49","event-place":"Cambridge","issued":{"date-parts":[["1949"]]},"publisher":"Addison-Wesley","publisher-place":"Cambridge","title":"Human Behavior and the Principle of Least Effort: An Introducton to Human Ecology","type":"book"}
]
